In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame

### 161. 필터링

다음 데이터프레임에서 현재가가 1500 이상인 값만 가져와보세요.

data = [  
    ["037730", "3R", 1510, 7.36],  
    ["036360", "3SOFT", 1790, 1.65],  
    ["005760", "ACTS", 1185, 1.28],  
]  
columns = ["종목코드", "종목명", "현재가", "등락률"]  
df = pd.DataFrame(data=data, columns=columns)  
df.set_index('종목코드', inplace=True)

In [2]:
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)
df.set_index('종목코드', inplace=True)

cond = df['현재가'] >= 1500

df[cond]

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

### 162. 필터링

위 데이터프레임에서 현재가가 1,500원 이상이면서 1,700원 미만인 값만 필터링 해보세요.

In [3]:
cond1 = df['현재가'] >= 1500
cond2 = df['현재가'] < 1700

df[cond1 & cond2]

       종목명   현재가   등락률
종목코드
037730  3R  1510  7.36

### 163. 컬럼추가

다음 데이터프레임에 목표가 컬럼을 추가하세요. 목표가는 현재가에서 10% 상승한 가격입니다.

data = [  
    ["037730", "3R", 1510, 7.36],  
    ["036360", "3SOFT", 1790, 1.65],  
    ["005760", "ACTS", 1185, 1.28],  
]  
columns = ["종목코드", "종목명", "현재가", "등락률"]  
df = pd.DataFrame(data=data, columns=columns)  
df.set_index('종목코드', inplace=True)

In [5]:
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)
df.set_index('종목코드', inplace=True)

df['목표가'] = df['현재가'] * 1.1
df

          종목명   현재가   등락률     목표가
종목코드
037730     3R  1510  7.36  1661.0
036360  3SOFT  1790  1.65  1969.0
005760   ACTS  1185  1.28  1303.5

### 164. 로우 추가

데이터프레임에 LG전자의 데이터를 추가하세요.

종목코드	종목명	현재가	등락률  
066570	LG전자	60000	3.84

In [6]:
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)
df.set_index('종목코드', inplace=True)

df.loc['066570'] = ['LG전자', 60000, 3.84]
df

          종목명    현재가   등락률
종목코드
037730     3R   1510  7.36
036360  3SOFT   1790  1.65
005760   ACTS   1185  1.28
066570   LG전자  60000  3.84

### 165. 데이터 프레임 컬럼명 변경 (columns 속성)

다음 코드를 통해 데이터프레임을 생성합니다.

df = pd.DataFrame(data = [[1, 2, 3], [4, 5, 6]], columns=["A", "B", "C"])  
생성된 데이터프레임에서 columns 속성을 사용하여 컬럼명을 'a', 'b', 'c'로 변경하세요.

In [7]:
df = pd.DataFrame(data = [[1, 2, 3], [4, 5, 6]], columns=["A", "B", "C"])

df.columns = ['a', 'b', 'c']

df

   a  b  c
0  1  2  3
1  4  5  6

### 166. 데이터 프레임 컬럼명 변경 (rename 메소드)

다음 코드를 통해 데이터프레임을 생성합니다.

df = pd.DataFrame(data = [[1, 2, 3], [4, 5, 6]], columns=["A", "B", "C"])  
생성된 데이터프레임에서 rename 메소드를 사용해서 컬럼 'A'를 'a'로 변경해보세요.

In [19]:
df = pd.DataFrame(data = [[1, 2, 3], [4, 5, 6]], columns=["A", "B", "C"])

df.rename(columns = {'A':'a'})

   a  B  C
0  1  2  3
1  4  5  6

### 167. name 속성

다음 데이터프레임의 index의 name 속성을 'year'로 columns의 name 속성을 'company'로 변경하세요.

import pandas as pd  
import numpy as np  

data = {"카카오": [np.nan, 221, 35], "NAVER": [52, 47, 3]}  
index = [2019, 2020, 2021]  
df = pd.DataFrame(data=data, index=index)

In [20]:
data = {"카카오": [np.nan, 221, 35], "NAVER": [52, 47, 3]}
index = [2019, 2020, 2021]
df = pd.DataFrame(data=data, index=index)

df

        카카오  NAVER
2019    NaN     52
2020  221.0     47
2021   35.0      3

In [21]:
df.index.name = 'year'

In [22]:
df

        카카오  NAVER
year
2019    NaN     52
2020  221.0     47
2021   35.0      3

In [23]:
df.columns.name = 'company'

In [24]:
df

company    카카오  NAVER
year
2019       NaN     52
2020     221.0     47
2021      35.0      3

### 168. 데이터프레임 reindex

다음 데이터프레임에서 컬럼의 순서를 ['NAVER', '카카오']로 재정렬해보세요.

import pandas as pd  
import numpy as np  

data = {"카카오": [np.nan, 221, 35], "NAVER": [52, 47, 3]}  
index = [2019, 2020, 2021]  
df = pd.DataFrame(data=data, index=index)  
df

In [29]:
data = {"카카오": [np.nan, 221, 35], "NAVER": [52, 47, 3]}
index = [2019, 2020, 2021]
df = pd.DataFrame(data=data, index=index)
df

        카카오  NAVER
2019    NaN     52
2020  221.0     47
2021   35.0      3

In [28]:
df = df[['NAVER', '카카오']]
df

      NAVER    카카오
2019     52    NaN
2020     47  221.0
2021      3   35.0

In [31]:
df.reindex(['NAVER', '카카오'], axis=1)

      NAVER    카카오
2019     52    NaN
2020     47  221.0
2021      3   35.0

### 169. 데이터프레임 drop

데이터프레임에서 'NAVER' 컬럼을 삭제하세요.

import pandas as pd  
import numpy as np  

data = {"카카오": [np.nan, 221, 35], "NAVER": [52, 47, 3]}  
index = [2019, 2020, 2021]  
df = pd.DataFrame(data=data, index=index)  
df

In [32]:
data = {"카카오": [np.nan, 221, 35], "NAVER": [52, 47, 3]}
index = [2019, 2020, 2021]
df = pd.DataFrame(data=data, index=index)
df

        카카오  NAVER
2019    NaN     52
2020  221.0     47
2021   35.0      3

In [33]:
df.drop('NAVER', axis=1, inplace=True)
df

        카카오
2019    NaN
2020  221.0
2021   35.0

### 170. 데이터프레임 drop

다음 데이터프레임에서 '카카오'와 'NAVER' 컬럼을 삭제하세요.

import pandas as pd  
import numpy as np  

data = {"카카오": [np.nan, 221, 35],  
        "NAVER": [52, 47, 3],  
        "삼성전자": [17, 21, 13]}  
index = [2019, 2020, 2021]  
df = pd.DataFrame(data=data, index=index)  
df

In [34]:
data = {"카카오": [np.nan, 221, 35], 
        "NAVER": [52, 47, 3],
        "삼성전자": [17, 21, 13]}
index = [2019, 2020, 2021]
df = pd.DataFrame(data=data, index=index)
df

        카카오  NAVER  삼성전자
2019    NaN     52    17
2020  221.0     47    21
2021   35.0      3    13

In [35]:
df.drop(['카카오', 'NAVER'], axis=1, inplace=True)
df

      삼성전자
2019    17
2020    21
2021    13